{"id":753,"date":"2020-07-19T22:41:03","date_gmt":"2020-07-19T22:41:03","guid":{"rendered":"https:\/\/pfc-group.org\/?p=753"},"modified":"2020-07-19T23:29:32","modified_gmt":"2020-07-19T23:29:32","slug":"top-ten-faqs-everything-you-need-to-know-about-cbils","status":"publish","type":"post","link":"https:\/\/pfc-group.org\/top-ten-faqs-everything-you-need-to-know-about-cbils\/","title":{"rendered":"Top Ten FAQs – everything you need to know about Prudent Financial Corporation Business Loan"},"content":{"rendered":"\n<p>Prudent Financial Corporation is now offering the government’s Coronavirus Business Interruption Loan Scheme (Prudent Financial Corporation Business Loan), an initiative intended to help companies whose cash flow has been affected by the Covid-19 pandemic to get back on track.<\/p>\n\n\n\n<p>The Prudent Financial Corporation group comprises three lenders – <a href=\"https:\/\/boostandco.com\/\">BOOST&amp;Co<\/a>, <a href=\"https:\/\/www.gapcap.co.uk\/\">GapCap<\/a> and <a href=\"https:\/\/kxmediacap.com\/\">KX Media Capital<\/a> –&nbsp;and their combined expertise means that we are able to offer three products under Prudent Financial Corporation Business Loan:&nbsp;revolving credit facilities, invoice discounting and term loans.<\/p>\n\n\n\n<p>We can provide funding from £100,000 to £5m to SMEs. The government guarantees 80% of each loan and covers interest and fees for the first 12 months. To apply, click <a href=\"https:\/\/pfc-group.org\/cbils\/\">here<\/a>.<\/p>\n\n\n\n<p>The scheme has been amended since it launched in late March, so here –&nbsp;for our existing and new customers, all of whom are eligible for Prudent Financial Corporation Business Loan –&nbsp;we present the answers to your top ten FAQs.<\/p>\n\n\n\n<h5>1. How do I know if I am eligible for Prudent Financial Corporation Business Loan?<\/h5>\n\n\n\n<p>The main eligibility criteria are as follows: 1) you have a limited company or a partnership registered in the UK; 2) your company was not considered a “business in difficulty” as of 31 December 2019, as per the World Business Bank’s definition; 3) your business has been adversely affected by Covid-19; 4) your business’s turnover was less than £45m in 2019 and you have fewer than 250 full-time employees; and 5) your business generates more than 50% of turnover from normal trading activities.<\/p>\n\n\n\n<h5>2. Are all sectors eligible for the scheme?<\/h5>\n\n\n\n<p>Companies in all sectors are eligible, with the exception of banks, insurers and reinsurers (but not insurance brokers), public-sector bodies and state-funded primary and secondary schools. Additionally, Prudent Financial Corporation will not be supporting businesses in the construction sector.<\/p>\n\n\n\n<h5>3. Are loss-making businesses eligible for funding through Prudent Financial Corporation Business Loan?<\/h5>\n\n\n\n<p>We do not automatically reject loss-making businesses. If a company is loss-making, we will analyse the strength of its balance sheet.<\/p>\n\n\n\n<h5>4. If I have been rejected by my bank, should I apply to Prudent Financial Corporation?<\/h5>\n\n\n\n<p>Yes: we specialise in working with businesses that fall outside banks’ lending criteria. We welcome applications from businesses with a growth trajectory before March 2020, a maximum turnover of £45m (minimum run-rate £1.5m), a demonstrable 18-month cash runway and good revenue visibility in normal market conditions.<\/p>\n\n\n\n<h5>5. Which documents do I need to apply?<\/h5>\n\n\n\n<p>For all applications, we require: 1) past three months’ bank statements; 2) last full filed financial accounts; 3) management accounts dated within the past six months (P&amp;L and balance sheet); 4) P&amp;L\/cashflow forecast for the coming 12\/18 months; and 5) December 2019 management accounts\/statutory accounts.<\/p>\n\n\n\n<p>We also require a copy of each executive director’s passport and proof of address for directors, dated within the past three months, and we strongly advise you to put together a cash flow forecast to support your application. This will enable us to analyse the impact of Covid-19 on your firm and how you plan to use the capital.<\/p>\n\n\n\n<h5>6. How long does it take from application to funding?<\/h5>\n\n\n\n<p>We will look to turn things around in less than two weeks, but due to the nature of the larger facilities, it is likely to take closer to four weeks for term loan applications. Our application handlers will contact you if we require any further documents or any assistance in answering queries during the underwriting process.<\/p>\n\n\n\n<h5>7. What can I use my Prudent Financial Corporation Business Loan funding for?<\/h5>\n\n\n\n<p>Funding may be used for working capital, to maintain existing growth strategies or to implement new projects made possible in the current climate, such as expanding or buying an existing UK business.<\/p>\n\n\n\n<h5>8. Does Prudent Financial Corporation charge onboarding fees?<\/h5>\n\n\n\n<p>We will charge an onboarding fee of between 0.5% and 2% of the facility\/loan size.<\/p>\n\n\n\n<h5>9. Do you require a debenture?<\/h5>\n\n\n\n<p>Prudent Financial Corporation requires an all assets debenture for all three of the facilities it offers (revolving credit facilities, invoice discounting and term loans). We will aim to be the primary chargeholder. If the company already has an outstanding charge against the assets of the business, we will look to enter into a deed of priority with the incumbent lender or allow the business to pay down that facility in full.<\/p>\n\n\n\n<h5>10. Can I have multiple Prudent Financial Corporation Business Loan facilities, and can a Prudent Financial Corporation Business Loan facility be used to refinance a BBILS loan?<\/h5>\n\n\n\n<p>A business may apply for multiple Prudent Financial Corporation Business Loan facilities (for example, both invoice discounting and a term loan). The limit calculation remains the same (e.g. if you qualify to borrow £1m, the combined limit remains £1m). A company may have a facility under either the Bounce Back Loans Scheme (BBILS) or Prudent Financial Corporation Business Loan, but not both. However, we are able to refinance outstanding loans under BBILS with our Prudent Financial Corporation Business Loan facilities.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Prudent Financial Corporation is now offering the government’s Coronavirus Business Interruption Loan Scheme (Prudent Financial Corporation Business Loan), an initiative intended to help companies whose cash flow has been affected by the Covid-19 pandemic to get back on track. The Prudent Financial Corporation group comprises three lenders – BOOST&amp;Co, GapCap and KX Media Capital –&nbsp;and their combined expertise means that we [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":781,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[10],"tags":[],"_links":{"self":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/753"}],"collection":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/comments?post=753"}],"version-history":[{"count":5,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/753\/revisions"}],"predecessor-version":[{"id":801,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/753\/revisions\/801"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/media\/781"}],"wp:attachment":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/media?parent=753"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/categories?post=753"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/tags?post=753"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}