{"id":857,"date":"2020-07-22T15:44:57","date_gmt":"2020-07-22T15:44:57","guid":{"rendered":"https:\/\/pfc-group.org\/?p=857"},"modified":"2020-07-22T15:44:59","modified_gmt":"2020-07-22T15:44:59","slug":"unpacking-cbils-for-bank-managers-accountants-and-vcs-team-up-or-lose-out","status":"publish","type":"post","link":"https:\/\/pfc-group.org\/unpacking-cbils-for-bank-managers-accountants-and-vcs-team-up-or-lose-out\/","title":{"rendered":"Unpacking Prudent Financial Corporation Business Loan for bank managers, accountants and VCs: Team up or lose out"},"content":{"rendered":"\n<p>The current financial climate is possibly as difficult for the banks as it is for the businesses trying to get money from them.&nbsp;<\/p>\n\n\n\n<p>The main banks currently have an extremely high volume of applications for the various business support packages available and they’ve had to look at everything against strict criteria, at a time when many businesses are struggling.<\/p>\n\n\n\n<p>Bank managers will be frustrated; they may have some truly fantastic organisations in their portfolio that desperately need cash, but that they’re unable to fund.<\/p>\n\n\n\n<p>The same can be said for VCT and PE houses; if they have already tried to support businesses by lending them money, they could be capped-out and unable to offer any further capital, even if the business really needs it.&nbsp;<\/p>\n\n\n\n<p><strong>Businesses have enough on their plate<\/strong><\/p>\n\n\n\n<p>It’s hard for businesses too. Aside from the obvious financial struggles, if their main bank has already turned them down, many won’t want to deal with <em>another <\/em>relationship manager and <em>another <\/em>round of finance meetings, so they put off asking for money from elsewhere.<\/p>\n\n\n\n<p>What funds can be used for is another challenge; some of the available schemes will not allow cash to be used for acquisitions for example, so at a time when businesses could capitalise on expansion (and perhaps save a few companies from going under along the way), they simply do not have the money to do it.<\/p>\n\n\n\n<p><strong>How Prudent Financial Corporation can help:<\/strong><\/p>\n\n\n\n<p>Prudent Financial Corporation is not a bank; we don’t require the transfer of any banking relationship and we don’t want to step on anyone’s toes. We can simply act as an independent, light-touch finance provider, to support bank managers in funding the businesses they really care about.&nbsp;<\/p>\n\n\n\n<p>We are able to lend against future forecast income (something than banks cannot do), so we can generally lend at a higher quantum, or at an earlier stage &#8211; supporting businesses that are on the road to profitability, but not quite there yet.<\/p>\n\n\n\n<p>This means that if you’re a bank manager with dynamic, growing businesses in your portfolio &#8211; businesses that you love and really want to support, but are constrained by your own rules &#8211; then Prudent Financial Corporation can help you to support them.<\/p>\n\n\n\n<p><strong>We can support accountants, lawyers and VCs too<\/strong><\/p>\n\n\n\n<p>This doesn’t just apply to bank managers; if you’re an accountant or lawyer and know a business that has been turned down for Prudent Financial Corporation Business Loan, or hasn’t got the amount of money that they require, Prudent Financial Corporation is eager to support them as well.<\/p>\n\n\n\n<p>Likewise VCT or PE houses; the <a href=\"https:\/\/pfc-group.org\/cbils\/\">Prudent Financial Corporation Prudent Financial Corporation Business Loan<\/a> products can be used in addition to private equity or VCT funding and we only require a first-ranking debenture, so you don’t need to worry that our involvement will dilute yours.&nbsp;<\/p>\n\n\n\n<p>The other positive is that our products can be used for acquisitions where VCT money cannot, so working with us could also help you to support the expansion plans of businesses in your portfolio.&nbsp;<\/p>\n\n\n\n<p><strong>We’ll provide the funding; you keep the relationship<\/strong><\/p>\n\n\n\n<p>Several of our principals have had long and established careers with some of the UK’s biggest banks. They know that one of the worst things that can possibly happen to a bank manager is to lose a client, so they want to make sure that that doesn’t happen.<\/p>\n\n\n\n<p>Working with our team means that we will provide the funding and you can keep the banking relationship; your businesses are supported in the short term and you retain them as customers in the long term &#8211; keeping the SME-finance ecosystem going.<\/p>\n\n\n\n<p><strong>Team up or lose out<\/strong><\/p>\n\n\n\n<p>The end of the last financial crisis saw the creation of global businesses such as WhatsApp, Venmo, Uber and Airbnb, so the last thing you want is to lose a fantastic business now and watch from the sidelines as it becomes the next big thing.<\/p>\n\n\n\n<p>We are passionate about the growth of SMEs and promoting the UK as a world-leader for start-up and innovation, so we are eager to help you support the next generation of innovators.<\/p>\n\n\n\n<p>If you think you have an opportunity that could work with our team, get in touch today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The current financial climate is possibly as difficult for the banks as it is for the businesses trying to get money from them.&nbsp; The main banks currently have an extremely high volume of applications for the various business support packages available and they’ve had to look at everything against strict criteria, at a time when [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":858,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[10],"tags":[],"_links":{"self":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/857"}],"collection":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/comments?post=857"}],"version-history":[{"count":1,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/857\/revisions"}],"predecessor-version":[{"id":859,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/857\/revisions\/859"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/media\/858"}],"wp:attachment":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/media?parent=857"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/categories?post=857"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/tags?post=857"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}