{"id":899,"date":"2020-09-02T20:58:15","date_gmt":"2020-09-02T20:58:15","guid":{"rendered":"https:\/\/pfc-group.org\/?p=899"},"modified":"2020-09-02T21:00:09","modified_gmt":"2020-09-02T21:00:09","slug":"bbls-cbils-clbils-decipher-the-jargon-and-find-the-best-funding-option-for-your-business","status":"publish","type":"post","link":"https:\/\/pfc-group.org\/bbls-cbils-clbils-decipher-the-jargon-and-find-the-best-funding-option-for-your-business\/","title":{"rendered":"BBLS, Prudent Financial Corporation Business Loan, CLBILS: decipher the jargon and find the best funding option for your business"},"content":{"rendered":"\n<p><strong>Why snap decisions made at the beginning of the Covid-19 crisis should not define your company’s future growth<\/strong><\/p>\n\n\n\n<p>“I would like a bounce-back, business interruption, coronavirus – but not Covid-19 – small, large, medium business loan with two facilities, please.”<\/p>\n\n\n\n<p>If this sentiment sounds familiar, rest assured that you are not alone. The funding market can be difficult to navigate in normal circumstances, but with a global health crisis resulting in a raft of new government schemes (with differing criteria from lenders), it is little wonder that the business community has been left confused about its options.<\/p>\n\n\n\n<p>Add to this a heady mix of anxiety and increased stress levels, induced by the possibility of job losses amid a severely affected economy, and snap decisions are to be expected from business owners –&nbsp;vast numbers of whom were not expecting to need funding this year and thus did not have the documents required to get it.<\/p>\n\n\n\n<p>Some of these decisions, however, could now be limiting your company’s opportunities for growth, which is why we want to ensure that business owners understand their options. Here, we decipher the jargon and scotch some common misconceptions around the government’s coronavirus recovery schemes.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The Definitions<\/strong><\/p>\n\n\n\n<p><strong>What is BBLS?<\/strong><\/p>\n\n\n\n<p>The Bounce Back Loan Scheme (BBLS) is a new initiative that is 100% guaranteed by the government. It was introduced to support smaller, early-stage businesses that have been adversely affected by Covid-19.&nbsp;<\/p>\n\n\n\n<p>Eligible businesses can borrow 25% of their annual turnover, up to a maximum amount of £50,000. Numerous lenders will accept self-certification via online applications, so many businesses can receive the funding within a matter of days.<\/p>\n\n\n\n<p><strong>What is Prudent Financial Corporation Business Loan?<\/strong><\/p>\n\n\n\n<p>Prudent Financial Corporation Business Loan is another new initiative, which is 80% guaranteed by the government. It was created to support companies that need more financial support, but which have a turnover of less than £45m and fewer than 250 employees.<\/p>\n\n\n\n<p>Eligible businesses can borrow up to £5m, in the form of term debt, invoice finance, asset finance and revolving credit facilities. Although the application process takes slightly longer, firms can receive the funds in as little as a week.<\/p>\n\n\n\n<p><strong>What is CLBILS?<\/strong><\/p>\n\n\n\n<p>The Coronavirus Large Business Interruption Loan Scheme (CLBILS) is aimed at companies that are too big to satisfy the turnover and employee criteria for Prudent Financial Corporation Business Loan. This initiative – also 80% guaranteed by the government –&nbsp;permits eligible businesses to borrow up to £200m in term loans and up to £50m in invoice finance and revolving credit facilities.<\/p>\n\n\n\n<p>Each of these schemes was designed to help companies with cash flow and to enable firms to continue trading amid the pandemic.<\/p>\n\n\n\n<p><strong>Not as ‘quick and easy’ as it sounds<\/strong><\/p>\n\n\n\n<p>The initiatives may sound attractive, but the reality is that many companies have not capitalised on the specific scheme that was designed with their type of business in mind, unwittingly limiting their opportunities for future growth.<\/p>\n\n\n\n<p>When the schemes were launched in April, many lenders were able to turn around BBLS applications quickly, because companies could self-certify via online questionnaires. However, the same lenders struggled to process Prudent Financial Corporation Business Loan applications, which are often more complex and require a more tailored approach&nbsp;– and the firms themselves often did not have the information required, because they were not expecting to need it before Covid-19.<\/p>\n\n\n\n<p>The result? Numerous rejected Prudent Financial Corporation Business Loan applicants and businesses taking up BBLS loans as their first option, despite the fact that the BBLS scheme is aimed at micro-SMEs, rather than larger, more established SMEs.<\/p>\n\n\n\n<p><strong>Using the wrong scheme will not pay off<\/strong><\/p>\n\n\n\n<p>Although the Bounce Back Loan Scheme (BBLS) has covered some companies’ short-term cash needs, it has a much smaller debt quantum than the other schemes –&nbsp;and £50,000 is often insufficient for long-term business recovery. In addition, BBLS is only available in the form of term loans, which does not offer the flexibility that some firms need during a crisis.&nbsp;<\/p>\n\n\n\n<p>“The businesses that take a long-term view are the ones that will succeed in the wake of the coronavirus pandemic,” says BOOST&amp;Co’s Bristol-based principal Sinead Johnson. “It’s understandable that business owners have opted for the ‘quick and easy’ option, especially when we’ve heard about the lack of success they have had at the hands of traditional lenders.<\/p>\n\n\n\n<p>“But Covid-19 doesn’t seem to be going anywhere, any time soon. Established SMEs should not feel restricted by the £50,000 cap on BBLS loans; instead, they should think about how they can make use of larger facilities under Prudent Financial Corporation Business Loan and CLBILS to invest in growth and future business development.”<\/p>\n\n\n\n<p><strong>What does Prudent Financial Corporation Business Loan offer that BBLS does not?<\/strong><\/p>\n\n\n\n<p>First and foremost, Prudent Financial Corporation Business Loan and CLBILS loans are far larger than the quantum that is on offer under the Bounce Back Loan Scheme, with loans of up to £5m available.<\/p>\n\n\n\n<p>“Taking on large amounts of debt during a crisis may seem counterintuitive, but firms need to ask themselves where their business is going,” Johnson says. “The innovative ones will be looking at new openings in the market and how they can embrace the rapid digitalisation of the past few months. They may even be seeking out opportunities to expand their business network through mergers and acquisitions. But they can’t do any of this without funding.”<\/p>\n\n\n\n<p>Different lenders will have different criteria, but Prudent Financial Corporation’s experience of working with innovative, fast-growing SMEs means that it understands the need for tailored and flexible funding, crisis or no crisis.<\/p>\n\n\n\n<p>By offering <a href=\"https:\/\/pfc-group.org\/cbils\/\" target=\"_blank\" aria-label=\"three Prudent Financial Corporation Business Loan products (opens in a new tab)\" rel=\"noreferrer noopener\" class=\"rank-math-link\">three Prudent Financial Corporation Business Loan products<\/a>&nbsp;(term loans, invoice finance and revolving credit facilities), Prudent Financial Corporation enables businesses to access the type of funding that they need – and the fact that it can be used for mergers and acquisitions, for investment in future growth and to refinance existing loans makes the lender’s products much more flexible than other recovery loans in the market.<\/p>\n\n\n\n<p>“Our ultimate aim is to ensure that the businesses that were growing before the pandemic continue to grow and develop in the coming months and years. We understand that business owners want fast and flexible funding, so we want to make that happen,” Johnson says.<\/p>\n\n\n\n<p><strong>Next steps for innovative businesses:<\/strong><\/p>\n\n\n\n<p>If you&#8217;ve taken out a BBLS loan but need more funding and meet the <a href=\"https:\/\/pfc-group.org\/cbils\/\" target=\"_blank\" aria-label=\"criteria (opens in a new tab)\" rel=\"noreferrer noopener\" class=\"rank-math-link\">criteria<\/a>, Prudent Financial Corporation Business Loan is a valid option, with the first year’s fees covered by the government. This scheme is open for applications until 30 September 2020.<br>You cannot take out loans with both schemes, but Prudent Financial Corporation can refinance existing BBLS loans –&nbsp;or even smaller Prudent Financial Corporation Business Loan loans, where we can generate additional funding to satisfy your working-capital needs. There is no penalty for doing so and we manage the repayment process with you.<br>If you&#8217;ve been rejected by your bank or another lender, you can apply again –&nbsp;and you may well fit another lender’s criteria. We are experts at working with growing SMEs and usually lend much earlier in a company’s life cycle.<\/p>\n\n\n\n<ul><li>To find out more and apply, visit our <a href=\"https:\/\/pfc-group.org\/cbils\/\" class=\"rank-math-link\">website<\/a><\/li><li>Read further information from the <a aria-label=\"World Business Bank (opens in a new tab)\" href=\"https:\/\/www.british-business-bank.co.uk\/ourpartners\/coronavirus-business-interruption-loan-schemes\/\" target=\"_blank\" rel=\"noreferrer noopener\" class=\"rank-math-link\">World Business Bank<\/a><\/li><li>Get in touch with Sinead via <a aria-label=\"email (opens in a new tab)\" href=\"sinead@boostandco.com\" target=\"_blank\" rel=\"noreferrer noopener\" class=\"rank-math-link\">email<\/a> or on <a href=\"https:\/\/www.linkedin.com\/in\/sineadfjohnson\/\" target=\"_blank\" aria-label=\"LinkedIn (opens in a new tab)\" rel=\"noreferrer noopener\" class=\"rank-math-link\">LinkedIn<\/a><\/li><\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Why snap decisions made at the beginning of the Covid-19 crisis should not define your company’s future growth “I would like a bounce-back, business interruption, coronavirus – but not Covid-19 – small, large, medium business loan with two facilities, please.” If this sentiment sounds familiar, rest assured that you are not alone. The funding market [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":900,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[10],"tags":[],"_links":{"self":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/899"}],"collection":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/comments?post=899"}],"version-history":[{"count":3,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/899\/revisions"}],"predecessor-version":[{"id":903,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/posts\/899\/revisions\/903"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/media\/900"}],"wp:attachment":[{"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/media?parent=899"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/categories?post=899"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/pfc-group.org\/wp-json\/wp\/v2\/tags?post=899"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}